#!  /bin/bash
#   2024.4.16
#   xiaoxiao
#   检查系统负载：编写一个脚本以检查系统的负载情况，并在超过阈值时发送警报。可使用 uptime    命令和条件语句来实现。


#  threshold 阈值 如果系统负载超过1.0，就会触发警报
#  load 负载      负载值通常是 uptime 命令输出的最后一个字段的倒数第二个
#  在 Bash 脚本中，变量赋值时不应该有空格，因此为threshold=1.0。
threshold=1.0

#  -F 选项用于指定字段的分隔符，而在 [...] 中的部分是正则表达式，用于匹配字段分隔符。在这里，[, ]+ 匹配一个或多个连续出现的逗号和空格，表示 awk 应该将输入按照逗号和空格进行分割。

#  而 NF 是 awk 内置的变量，表示当前行的字段数。NF-2 就是倒数第二个字段的索引，因为 awk 中的字段索引是从 1 开始的，所以倒数第二个字段的索引就是 NF-2。

#  空格的作用是分隔不同的命令参数，确保 awk 命令的参数能够正确解析。
#  NF 的全称是 "Number of Fields"，表示当前行的字段数。
load=$(uptime | awk -F '[, ]+' '{print $(NF-2)}')


#  echo "$load > $threshold" | bc -l 的作用是将 $load 和 $threshold 的值作为字符串传递给    bc -l，然后 bc 将执行比较操作，如果 $load 大于 $threshold，则输出 1，否则输出 0。这个    结果将被 $(( )) 括号捕获，使得整个条件成为一个数值比较的表达式。
#  在 if (( )) 结构中，括号中的表达式将被解释为算术表达式。如果表达式的结果为非零值，则条   件为真；如果结果为零，则条件为假。因此，无论 bc -l 返回的是 0 还是 1，在 if (( )) 中都   会被解释为逻辑值。
#  bc 是一个用于数学计算的命令行工具，它支持大多数常见的数学运算。在这个上下文中，bc -l     是指使用 bc 进行数学比较运算，并使用 -l 选项启用其标准数学库。

#  bc 的全称是“basic calculator”。

if (( $(echo "$load > $threshold" | bc -l) )); then
    echo "系统负载过高: $load" | mail -s "系统负载警报" admin@example.com
fi


#   echo 命令输出一条带有系统负载信息的消息，并通过管道 | 将该消息传递给 mail 命令。mail 命令用于发送电子邮件， -s 选项用于指定邮件的主题，admin@example.com 是收件人的电子邮件地址。
